<template>
    <div class="col-12 col-md-12 col-lg-12 col-xl-12 contact" :style="{ backgroundImage: `linear-gradient(180deg, rgba(255,255,255,1) 0%, rgba(255,255,255,1) ${backgroundPercents}, rgba(255,255,255,0) 75%),url(${backgroundUrl})`}">
        <div class="row ">
            <div class="col-12 col-md-12 col-lg-12 col-xl-12 contact-in">
                <h2 class="header top40">วิธีการเดินทาง</h2>
                <br>
                <p>
                    การเดินทางโดยรถส่วนตัว จากกรุงเทพฯ ( สถานีขนส่งสายใต้ใหม่ ) <br>
                    เดินทางออกจาก สถานีขนส่งสายใต้ใหม่ เข้าสู่ ทางคู่ขนาน ถนนบรมราชชนนี <br>
                    ————————————————1.4 กม.———————————————— <br>
                    ใช้ช่องทางขวา เพื่อใช้ทางลาดเข้าสู่ ถนน บรมราชชนนี/ถนนหมายเลข 338 <br>
                    ————————————————8.3 กม.————————————————  <br>
                    ชิดขวา เพื่อวิ่งต่อบน ถนนหมายเลข 338 <br>
                    ผ่าน 7-ELEVEN 5592 สาขา ปตท.LPG.บรมฯกม.24 (อีก 6.9 กม. ทางซ้าย) <br>
                    ————————————————17.0 กม.———————————————— <br>
                    ใช้ช่องทางใดก็ได้ เพื่อตัดเข้าสู่ ถนนหมายเลข 4 โดยใช้ทางลาดไป อ. นครชัยศรี/นครปฐม <br>
                    ————————————————18.3 กม.———————————————— <br>
                    ชิดซ้าย เพื่อวิ่งบน ถนนหมายเลข 4  <br>
                    ————————————————1.8 กม.———————————————— <br>
                    ขับตรงไปตลอดโดยวิ่งบน ถนนหมายเลข 4 <br>
                    ผ่าน บจก. โสภณสิริโบรกเกอร์ (อีก 550 ม. ทางซ้าย) <br>
                    ————————————————7.4 กม.———————————————— <br>
                    ใช้ 2 ช่องทางซ้าย เพื่อตัดเข้าสู่ ถนนหมายเลข 323/ถนนหมายเลข 3525 ไปทาง อ. บ้านโป่ง/กาญจนบุรี <br>
                    วิ่งต่อไปตามเส้นทาง ถนนหมายเลข 323 <br>
                    ————————————————11.2 กม.———————————————— <br>
                    ใช้ 2 ช่องทางขวา เพื่อเลี้ยวขวาที่ ทางแยก แสงชูโต และอยู่บน ถนนหมายเลข 323 <br>
                    ผ่าน ประดิษฐ์เจริญซาวด์ (อีก 16.6 กม. ทางซ้าย) <br>
                    ————————————————41.9 กม.———————————————— <br>
                    เลี้ยวขวา เข้าสู่ ถนนหมายเลข 367 <br>
                    ————————————————13.2 กม.———————————————— <br>
                    ที่ ทางแยก แก่งเสี้ยน ขับต่อไปยัง ถนนหมายเลข 323 <br>
                    ————————————————135 กม.———————————————— <br>
                    เลี้ยวขวา เพื่อวิ่งบน ถนนหมายเลข 323 <br>
                    ————————————————66.2 กม.———————————————— <br>
                    ชิดขวา เพื่อวิ่งบน ถนนหมายเลข 323 <br>
                    ————————————————2.9 กม.———————————————— <br>
                    วิ่งตรงต่อไป <br>
                    ————————————————3.8 กม.———————————————— <br>
                    เลี้ยวซ้าย เข้าสู่ ซอย สังขละบุรี <br>
                    ————————————————400 ม.———————————————— <br>
                    ถึงอำเภอสังขละบุรี <br>
                </p>
                <p class="line"></p>
                <br>
                <br>
                <h4>การเดินทางโดยรถประจำทาง </h4>
                <p>
                    จากสถานีขนส่งสายใต้นั่งรถ  กรุงเทพฯ - กาญจนบุรี <br>
                    ใช้เวลาประมาณ 2-3 ชั่วโมง โดยสามารถนั่งรถปรับอากาศ สายกรุงเทพฯ-กาญจนบุรี แล้วไปลงที่ สถานีขนส่งจังหวัดกาญจนบุรี  <br>
                    จากนั้นนั่งรถสาย กาญจนบุรี - ทองผาภูมิ – สังขละบุรี (รถไม่มีแอร์) แล้วไปลงที่ท่ารถสังขละบุรี ใช้เวลาในการเดินทาง จากตัวเมืองถึงสังขละบุรีประมาณ 4 ช.ม.  <br>
                    จากนั้นต่อรถมอเตอร์ไซต์รับจ้างไปยังที่พัก <br>
                </p>
                <p>
                    สามารถใช้บริการรถตู้ปรับอากาศ ของบริษัท เอเซียไทรโยคเดินรถ จำกัด ตั้งอยู่ใกล้กับสถานีขนส่งจังหวัดกาญจนบุรี  <br>
                    - อัตราค่าโดยสาร (สอบถามได้ที่ท่ารถของ บริษัท เอเซียไทรโยคเดินรถ จำกัด) <br>
                    - เวลารถ 7.30-16.30 น ทุก 1 ชั่วโมง  <br>
                    - ระยะเวลาเดินทาง ประมาณ 3 ชั่วโมง 30 นาที <br>
                </p>
                <br>
                <br>
                <h4>จากสถานีขนส่งสายเหนือ (หมอชิต) กรุงเทพฯ - ด่านเจดีย์สามองค์ </h4>
                <p>ใช้เวลาประมาณ 6 - 7 ชั่วโมง รถออกวันละ 4 รอบ (05.00  06.00  09.30  12.30)</p>
            </div>
        </div>
    </div>

</template>

<script>
import backgroundUrl from '~/assets/img/contact/Group424.jpg'

export default {
   data() {
    return { backgroundUrl,backgroundPercents : '' ,
      window: {
              width: 0,
              height: 0
      }
    }
  },
    created() {
        window.addEventListener('resize', this.handleResize);
        this.handleResize();
    },
    destroyed() {
        window.removeEventListener('resize', this.handleResize);
    },
    methods: {
        handleResize() {
            this.window.width = window.innerWidth;
            this.window.height = window.innerHeight;

            if(this.window.width > 1024){
              this.backgroundPercents = '45%';
            }else{
              this.backgroundPercents = '0%';
            }
        }
    }
  
}
</script>